# CLI utils
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'vim'
brew 'git'
brew 'go'
brew 'tree'
brew 'autojump'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'screen'
brew 'gnupg'
brew 'make'
brew 'cmake'
brew 'gcc'
brew 'less'
brew 'rsync'
brew 'unzip'
brew 'ripgrep'
brew 'fd'
brew 'pyenv'
brew 'direnv'
brew 'fzf'
brew 'zoxide'
brew 'shellcheck'

# Applications
brew 'kitty'
brew 'todoist'
brew 'hyperkey'
brew 'vlc'
brew 'dropbox'
brew 'google-drive'
brew 'bitwarden'
brew 'appcleaner'
brew 'linearmouse'
brew 'lunar'
brew 'raycast'
brew 'rectangle'
brew 'calibre'
brew 'licecap'
brew 'visual-studio-code'
brew 'firefox'
brew 'firefox@developer-edition'
brew 'arc'
brew 'iterm2'
brew 'pycharm-ce'



