# taps
tap 'homebrew/cask-fonts'
tap 'buo/cask-upgrade'


# CLI utils
brew 'mas'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'vim'
brew 'git'
brew 'go'
brew 'tree'
brew 'autojump'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'screen'
brew 'gnupg'
brew 'make'
brew 'cmake'
brew 'gcc'
brew 'less'
brew 'rsync'
brew 'unzip'
brew 'ripgrep'
brew 'fd'
brew 'pyenv'


# GUI utils
cask_args appdir: "/Applications"
mas install 937984704 # Amphetamine
cask 'vlc'
cask 'dropbox'
cask 'google-drive'
cask 'bitwarden'
cask 'appcleaner'
cask 'linearmouse'
cask 'lunar' # instead of monitorcontrol
cask 'raycast'
cask 'rectangle'
cask 'calibre'
cask 'licecap'
cask 'visual-studio-code'
cask 'firefox'
casl 'firefox@developer-edition'
cask 'arc'
cask 'iterm2'
cask 'pycharm-ce'
cask 'font-hack-nerd-font'



# extras

# fonts
#cask 'font-meslo-nerd-font-mono'
#cask 'font-hack-nerd-font'



